david4embedded/Embedded_Lab/source/application/STM32F439ZI_LwIP_TCPIP/Core/Src/main.cpp
/***************************************************************************************************
 * @file           : main.cpp
 * @brief          : Main program body
 * @details        : This file contains the main function and initializes the system.
 * @author         : Sungsu Kim
 * @date           : 2025-08-04
 * @copyright      : Copyright (c) 2025 Sungsu Kim
 ***************************************************************************************************/

/****************************************** Includes ***********************************************/
#include "common.h"
#include "main.h"
#include "stm32f4xx_nucleo_144.h"
#include "cmsis_os.h"
#include "usart.h"
#include "gpio.h"

/**************************************** External Functions ***************************************/
extern void MX_FREERTOS_Init     ( );

/**************************************** Local Functions ******************************************/
static void SystemClock_Config   ( );

/*************************************** Function Definitions **************************************/
/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{
   HAL_Init();
   SystemClock_Config();

   MX_FREERTOS_Init();

   MX_GPIO_Init();
   MX_USART3_UART_Init();
   BSP_LED_Init( LED_RED );
   BSP_LED_Init( LED_GREEN );
   BSP_LED_Init( LED_BLUE );

   LOGGING( "Welcome to STM32F439ZI LwIP TCP/IP Application" );

   osKernelStart();

   while (1)
   { }
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
static void SystemClock_Config(void)
{
   RCC_OscInitTypeDef RCC_OscInitStruct = {0};
   RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

   /** Configure the main internal regulator output voltage
    */
   __HAL_RCC_PWR_CLK_ENABLE();
   __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

   /** Initializes the RCC Oscillators according to the specified parameters
    * in the RCC_OscInitTypeDef structure.
    */
   RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
   RCC_OscInitStruct.HSEState = RCC_HSE_ON;
   RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
   RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
   RCC_OscInitStruct.PLL.PLLM = 4;
   RCC_OscInitStruct.PLL.PLLN = 168;
   RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
   RCC_OscInitStruct.PLL.PLLQ = 7;
   if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
   {
      Error_Handler();
   }

   /** Initializes the CPU, AHB and APB buses clocks
    */
   RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                               |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
   RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
   RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
   RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
   RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

   if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
   {
      Error_Handler();
   }
}

/**
 * @brief Redirects the C library printf function to the USART2.
 * @param file: File descriptor (not used)
 * @param ptr: Pointer to the data to be sent
 * @param len: Length of the data to be sent
 * @retval Number of bytes written
 */
extern "C" int _write(int file, char *ptr, int len)
{
   HAL_UART_Transmit_IT(&huart3, (uint8_t*)ptr, len); 
}

/**
 * @brief  Period elapsed callback in non blocking mode
 * @note   This function is called  when TIM6 interrupt took place, inside
 *         HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment a global variable "uwTick" used as application time base.
 * @param  htim : TIM handle
 * @retval None
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
   if ( htim->Instance == TIM6 ) 
   {
      HAL_IncTick();
   }
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
   __disable_irq();
   while (1)
   { }
}

#ifdef  USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line)
{

}
#endif /* USE_FULL_ASSERT */
